starter-kit-defuns.html
<?xml version="1.0" encoding="iso-8859-1"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
               "http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml"
lang="en" xml:lang="en">
<head>
<title>Starter Kit Defuns</title>
<meta http-equiv="Content-Type" content="text/html;charset=iso-8859-1"/>
<meta name="generator" content="Org-mode"/>
<meta name="generated" content="2011-06-17 11:10:10 PDT"/>
<meta name="author" content="Eric Schulte"/>
<meta name="description" content=""/>
<meta name="keywords" content=""/>
<link rel="stylesheet" href="emacs.css" type="text/css"/>

</head>
<body>
<div id="content">

<h1 class="title">Starter Kit Defuns</h1>
<p>This is part of the <a href="starter-kit.html">Emacs Starter Kit</a>.
</p>

<div id="outline-container-1" class="outline-2">
<h2 id="sec-1">The starter-kit-coding-hook: </h2>
<div class="outline-text-2" id="text-1">

<p>A single hook holding those functions which should be run in <b>every</b>
code buffer.
</p>
<p>
We have a number of turn-on-* functions since it's advised that lambda
functions not go in hooks. Repeatedly evaling an add-to-list with a
hook value will repeatedly add it since there's no way to ensure that
a lambda doesn't already exist in the list.
</p>



<pre class="src src-emacs-lisp">(<span class="org-keyword">defun</span> <span class="org-function-name">starter-kit-local-column-number-mode</span> ()
  (make-local-variable 'column-number-mode)
  (column-number-mode t))

(<span class="org-keyword">defun</span> <span class="org-function-name">starter-kit-local-comment-auto-fill</span> ()
  (set (make-local-variable 'comment-auto-fill-only-comments) t)
  (auto-fill-mode t))

(<span class="org-keyword">defun</span> <span class="org-function-name">starter-kit-turn-on-save-place-mode</span> ()
  (setq save-place t))

(<span class="org-keyword">defun</span> <span class="org-function-name">starter-kit-turn-on-whitespace</span> ()
  (whitespace-mode t))

</pre>




<pre class="src src-emacs-lisp">(add-hook 'starter-kit-coding-hook 'starter-kit-local-column-number-mode)

</pre>




<pre class="src src-emacs-lisp">(add-hook 'starter-kit-coding-hook 'starter-kit-local-comment-auto-fill)

</pre>




<pre class="src src-emacs-lisp">(add-hook 'starter-kit-coding-hook 'starter-kit-pretty-lambdas)

</pre>




<pre class="src src-emacs-lisp">(<span class="org-keyword">defun</span> <span class="org-function-name">run-starter-kit-coding-hook</span> ()
  <span class="org-doc">"Enable things that are convenient across all coding buffers."</span>
  (run-hooks 'starter-kit-coding-hook))

</pre>


</div>
</div>

</div>
</body>
</html>
